doom/README.org
#+TITLE: DOOM init
#+auto-tangle: true

* DOOM Files
** Init.el Header

This is a literate config, so we must put the location at the front of the `init.el`. Also, we need to open the doom package list here
#+begin_src elisp :tangle init.el
;;; $DOOMDIR/init.el -*- lexical-binding: t; -*-

(setq +literate-config-file "README.org")

(doom! :input
#+end_src

The ==config.el== hosts all of the user-configuration

Some functionality depends on user-name and email, so we'll set that at the top
#+begin_src elisp :tangle config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
(setq user-full-name "Zoe Gagnon"
      user-email-address "zell@mechanical-orchard.com")
#+end_src

* Language support
:PROPERTIES:
:header-args: :comments org
:END:

Doom language support is configured first.

#+begin_src elisp :tangle init.el
       ;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
       ;;chinese
       ;;japanese
       ;;layout            ; auie,ctsrnm is the superior home row
#+end_src

* Completions
:PROPERTIES:
:header-args: :comments org
:END:

Completion configurations enable and control various completion tools

#+begin_src elisp :tangle init.el
       :completion
#+end_src

** Code
:PROPERTIES:
:header-args: :comments org
:END:

Company is an in-line auto complete for suggestions. We can control if the suggestions are
in a childframe or popover

#+begin_src elisp :tangle init.el
       (company +childframe)           ; the ultimate code completion backend
#+end_src

** Search
:PROPERTIES:
:header-args: :comments org
:END:

Vertico enhances emacs' built-in search with further capability. Searches files and file contents
#+begin_src elisp :tangle init.el
       ;;helm              ; the *other* search engine for love and life
       ;;ido               ; the other *other* search engine...
       ;;ivy               ; a search engine for love and life
       (vertico +icons)           ; the search engine of the future
#+end_src

** Copilot
Install Github Copilot

#+begin_src elisp :tangle packages.el
;;; $DOOMDIR/packages.el -*- lexical-binding: t; -*-
(package! copilot
  :recipe (:host github :repo "copilot-emacs/copilot.el" :files ("*.el" "dist")))
#+end_src

#+begin_src elisp :tangle config.el

(use-package! copilot
  :hook (prog-mode . copilot-mode)
  :bind (:map copilot-completion-map
              ("<tab>" . 'copilot-accept-completion)
              ("TAB" . 'copilot-accept-completion)
              ("C-TAB" . 'copilot-accept-completion-by-word)
              ("C-<tab>" . 'copilot-accept-completion-by-word)))

#+end_src
* UI
:PROPERTIES:
:header-args: :comments org
:END:

UI configurations change the way DOOM appears
#+begin_src elisp :tangle init.el
       :ui
       ;;deft              ; notational velocity for Emacs
#+end_src

** DOOM
:PROPERTIES:
:header-args: :comments org
:END:

The doom package creates the overall appearance of DOOM. Includes styles, but also search menus
like `SPC-f-p`

#+begin_src elisp :tangle init.el
       doom              ; what makes DOOM look the way it does
#+end_src

We can then use it to set the fonts. See 'C-h v doom-font' for documentation and more examples of what they accept.
#+begin_src elisp :tangle config.el
(setq doom-font (font-spec :family "FiraCode Nerd Font" :size 18 :weight 'medium)
      doom-variable-pitch-font (font-spec :family "FiraCode Nerd Font" :size 18)
      doom-symbol-font (font-spec :family "FiraCode Nerd Font" :size 18)
      doom-serif-font (font-spec :family "FiraCode Nerd Font" :size 18))

(setq window-divider-default-right-width 4
      window-divider-default-bottom-width 4)
#+end_src

And the theme. doom-fairy-floss is purple, good for day and night
#+begin_src elisp :tangle config.el

(setq doom-theme 'doom-library)
#+end_src

*** Doom Dashboard

Enables the dashboard and gives an unkillable fallback if all buffers are killed
#+begin_src elist :tangle init.el
       doom-dashboard    ; a nifty splash screen for Emacs
#+end_src

*** Doom Quit

Allows customizing the quit interaction

#+begin_src elisp :tangle init.el
       ;;doom-quit         ; DOOM quit-message prompts when you quit Emacs
#+end_src

*** Emoji

Allows using emoji in the app. Include the unicode and github support

#+begin_src elisp :tangle init.el
       (emoji +unicode +github)  ; 🙂
#+end_src

*** Hightlight TODO

Add highlight to various todo comments

#+begin_src elisp :tangle init.el
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
#+end_src

*** Hydra

Hydra is an emacs window management shortcut module. It is deprecated

#+begin_src elisp :tangle init.el
       ;;hydra
#+end_src

*** Indent Guides

Adds a verticle line showing indent depth levels

#+begin_src elisp :tangle init.el
       ;;indent-guides     ; highlighted indent columns
#+end_src

*** Ligatures

Enable font ligatures in various contexts

#+begin_src elisp :tangle init.el
       ligatures         ; ligatures and symbols to make your code pretty again
#+end_src

Set up ligatures for elixir
#+begin_src elisp :tangle config.el
(add-hook
 'elixir-mode-hook
 (lambda ()
   (push '(">=" . ?\u2265) prettify-symbols-alist)
   (push '("<=" . ?\u2264) prettify-symbols-alist)
   (push '("!=" . ?\u2260) prettify-symbols-alist)
   (push '("==" . ?\u2A75) prettify-symbols-alist)
   (push '("=~" . ?\u2245) prettify-symbols-alist)
   (push '("<-" . ?\u2190) prettify-symbols-alist)
   (push '("->" . ?\u2192) prettify-symbols-alist)
   (push '("<-" . ?\u2190) prettify-symbols-alist)
   (push '("|>" . ?\u25B7) prettify-symbols-alist)))
 #+end_src

*** Minimap

Enables a minimap of the file on the right hand side

#+begin_src elisp :tangle init.el
       minimap           ; show a map of the code on the side
#+end_src

*** Modeline

Informative modeline on the bottom of the screen

#+begin_src elisp :tangle init.el
       modeline          ; snazzy, Atom-inspired modeline, plus API
#+end_src

*** Nav-Flash

When dragging an action across several lines with vim motions, nav-flash will blink the cursor. This helps locate
it after a big move

#+begin_src elisp :tangle init.el
       nav-flash         ; blink cursor line after big motions
#+end_src

*** Neotree

A vim-style project tree
#+begin_src elisp :tangle init.el
       ;;neotree           ; a project drawer, like NERDTree for vim
#+end_src

*** OPHints

When dragging an action across several lines with vim motions or regions, highlight the effected region
#+begin_src elisp :tangle init.el
       ophints           ; highlight the region an operation acts on
#+end_src

*** Popup

Keep popup windows from stealing focus or blocking things
#+begin_src elisp :tangle init.el
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
#+end_src

*** Tabs

Tab bar on top
#+begin_src elisp :tangle init.el
       tabs              ; a tab bar for Emacs
#+end_src

*** Treemacs

Emacs-style project tree instead
#+begin_src elisp :tangle init.el
       treemacs          ; a project drawer, like neotree but cooler
#+end_src

*** Extended Unicode

Support for non-latin languages
#+begin_src elisp :tangle init.el
        ;unicode           ; extended unicode support for various languages
#+end_src

*** VC Gutter

Show git changes in the gutter. +pretty adds a nice coloring to it
#+begin_src elisp :tangle init.el
       (vc-gutter +pretty) ; vcs diff in the fringe
#+end_src

*** VI Tilde Fringe

Show a ~ in the left fringe to indicate empty lines
#+begin_src elisp :tangle init.el
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
#+end_src

*** TODO Window Select

Where we're going, we don't need mouse
#+begin_src elisp :tangle init.el
        window-select     ; visually switch windows
#+end_src

*** Workspaces

Add tabs and persistant workspaces
#+begin_src elisp :tangle init.el
       workspaces        ; tab emulation, persistence & separate workspaces
#+end_src

*** Zen Mode

Does a lot of changes that I don't like
#+begin_src elisp :tangle init.el
       ;;zen               ; distraction-free coding or writing
#+end_src

* Editor Modifications

** Basic editor configuration

*** Tab Width
 #+begin_src elisp :tangle config.el

(setq-default tab-width 2)
 #+end_src

*** Word Wrap

#+begin_src elisp :tangle config.el
(global-visual-line-mode 1)
#+end_src

*** Window Size
 Set a more reasonable default for opening a new client window. The very small window causes a lot of thrash when the window manager grabs a hold of it
 #+begin_src elisp :tangle config.el

(if (display-graphic-p)
    (progn
      (setq initial-frame-alist
            '((tool-bar-lines . 0)
              (width . 200)
              (height . 400)
              )
            )
      )
  )
 #+end_src


** Doom Modules
A set of modules that change the way the editor works
#+begin_src elisp :tangle init.el
       :editor
#+end_src

*** Super-Save Mode
:PROPERTIES:
:header-args: :comments org
:END:

[[https://github.com/bbatsov/super-save][Super-Save]] is a minor mode to save on window events.

#+begin_src elisp :tangle packages.el
(package! super-save)
;(use-package! super-save)

#+end_src

In order for it to hook in to org mode, we need to load it after that
 #+begin_src elisp :tangle config.el

(after! org
  (super-save-mode +1))

(setq auto-save-default nil)
 #+end_src

*** EVIL

Only way emacs is good
#+begin_src elisp :tangle init.el
       (evil +everywhere); come to the dark side, we have cookies
#+end_src

*** Expand Region
(non-doom)

#+begin_src elisp :tangle packages.el
(package! expand-region)
#+end_src

#+begin_src elisp :tangle config.el
(use-package! expand-region
  :bind ("C-=" . er/expand-region))
#+end_src
*** File Templates

Inserts a snippet when opening a blank file
#+begin_src elisp :tangle init.el
       file-templates    ; auto-snippets for empty files
#+end_src

*** Folding

Code folding. Not interesting, occasionaly useful. May delete it later
#+begin_src elisp :tangle init.el
fold              ; (nigh) universal code folding
#+end_src

*** Format

Auto-formatting. + doing it on save. Don't fight about brackets, please
#+begin_src elisp :tangle init.el
       (format +onsave)  ; automated prettiness
#+end_src

*** God Mode

Emacs people are pretty dramatic
#+begin_src elisp :tangle init.el
       ;;god               ; run Emacs commands without modifier keys
#+end_src

*** Lispy

Editor enhancements for when programing lisp
#+begin_src elisp :tangle init.el
       ;;lispy             ; vim for lisp, for people who don't like vim
#+end_src

*** Multiple Cursors

Enables multi-cursor editing via [[https://github.com/hlissner/evil-multiedit][Evil Multi-Edit]]
#+begin_src elisp :tangle init.el
       multiple-cursors  ; editing in many places at once
#+end_src

