doom/init.el
;;; $DOOMDIR/init.el -*- lexical-binding: t; -*-

(setq +literate-config-file "README.org")

(doom! :input

;; Language support
;; :PROPERTIES:
;; :header-args: :comments org
;; :END:

;; Doom language support is configured first.


;;bidi              ; (tfel ot) thgir etirw uoy gnipleh
;;chinese
;;japanese
;;layout            ; auie,ctsrnm is the superior home row

;; Completions
;; :PROPERTIES:
;; :header-args: :comments org
;; :END:

;; Completion configurations enable and control various completion tools


:completion

;; Code
;; :PROPERTIES:
;; :header-args: :comments org
;; :END:

;; Company is an in-line auto complete for suggestions. We can control if the suggestions are
;; in a childframe or popover


(company +childframe)           ; the ultimate code completion backend

;; Search
;; :PROPERTIES:
;; :header-args: :comments org
;; :END:

;; Vertico enhances emacs' built-in search with further capability. Searches files and file contents

;;helm              ; the *other* search engine for love and life
;;ido               ; the other *other* search engine...
;;ivy               ; a search engine for love and life
(vertico +icons)           ; the search engine of the future

;; UI
;; :PROPERTIES:
;; :header-args: :comments org
;; :END:

;; UI configurations change the way DOOM appears

:ui
;;deft              ; notational velocity for Emacs

;; DOOM
;; :PROPERTIES:
;; :header-args: :comments org
;; :END:

;; The doom package creates the overall appearance of DOOM. Includes styles, but also search menus
;; like `SPC-f-p`


doom              ; what makes DOOM look the way it does

;; Doom Dashboard

;; Enables the dashboard and gives an unkillable fallback if all buffers are killed

doom-dashboard    ; a nifty splash screen for Emacs

;; Doom Quit

;; Allows customizing the quit interaction


;;doom-quit         ; DOOM quit-message prompts when you quit Emacs

;; Emoji

;; Allows using emoji in the app. Include the unicode and github support


(emoji +unicode +github)  ; 🙂

;; Hightlight TODO

;; Add highlight to various todo comments


hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW

;; Hydra

;; Hydra is an emacs window management shortcut module. It is deprecated


;;hydra

;; Indent Guides

;; Adds a verticle line showing indent depth levels


;;indent-guides     ; highlighted indent columns

;; Ligatures

;; Enable font ligatures in various contexts


ligatures         ; ligatures and symbols to make your code pretty again

;; Minimap

;; Enables a minimap of the file on the right hand side


minimap           ; show a map of the code on the side

;; Modeline

;; Informative modeline on the bottom of the screen


modeline          ; snazzy, Atom-inspired modeline, plus API

;; Nav-Flash

;; When dragging an action across several lines with vim motions, nav-flash will blink the cursor. This helps locate
;; it after a big move


nav-flash         ; blink cursor line after big motions

;; Neotree

;; A vim-style project tree

;;neotree           ; a project drawer, like NERDTree for vim

;; OPHints

;; When dragging an action across several lines with vim motions or regions, highlight the effected region

ophints           ; highlight the region an operation acts on

;; Popup

;; Keep popup windows from stealing focus or blocking things

(popup +defaults)   ; tame sudden yet inevitable temporary windows

;; Tabs

;; Tab bar on top

tabs              ; a tab bar for Emacs

;; Treemacs

;; Emacs-style project tree instead

(treemacs +lsp)          ; a project drawer, like neotree but cooler

;; Extended Unicode

;; Support for non-latin languages

;unicode           ; extended unicode support for various languages

;; VC Gutter

;; Show git changes in the gutter. +pretty adds a nice coloring to it

(vc-gutter +pretty) ; vcs diff in the fringe

;; VI Tilde Fringe

;; Show a ~ in the left fringe to indicate empty lines

vi-tilde-fringe   ; fringe tildes to mark beyond EOB

;; Window Select

;; Where we're going, we don't need mouse

window-select     ; visually switch windows

;; Workspaces

;; Add tabs and persistant workspaces

workspaces        ; tab emulation, persistence & separate workspaces

;; Zen Mode

;; Does a lot of changes that I don't like

;;zen               ; distraction-free coding or writing

:editor

(evil +everywhere); come to the dark side, we have cookies

file-templates    ; auto-snippets for empty files

fold              ; (nigh) universal code folding

(format +onsave)  ; automated prettiness

;;god               ; run Emacs commands without modifier keys

;;lispy             ; vim for lisp, for people who don't like vim

multiple-cursors  ; editing in many places at once
