doom/README.org
*** Text Object Editing

Makes emacs aware of [[https://github.com/clemera/objed][Text Objects]] and gives capability to navigate among them and manipulate them
#+begin_src elisp :tangle init.el
       ;;objed             ; text object editing for the innocent
#+end_src

*** Parinfer

Attempt to infer parenthesis for lisp code
#+begin_src elisp :tangle init.el
       ;;parinfer          ; turn lisp into python, sort of
#+end_src

*** Rotate Text

Given a configiguration with a list of text candidates, rotate between them with a keypress
#+begin_src elisp :tangle init.el
       ;;rotate-text       ; cycle region at point between text candidates
#+end_src

*** Snippets

Another way to expand text, this time for emacs only
#+begin_src elisp :tangle init.el
       snippets          ; my elves. They type so I don't have to
#+end_src

*** Word Wrap

Self explanatory
#+begin_src elisp :tangle init.el
       ;;word-wrap         ; soft wrapping with language-aware indent
#+end_src

** Emacs

This section of modules changes the way emacs works
#+begin_src elisp :tangle init.el
       :emacs
#+end_src

*** Dired

Directory navigation and editing. Not sure if I like it
#+begin_src elisp :tangle init.el
       dired             ; making dired pretty [functional]
#+end_src

*** Electric Indent

Smart auto indent
#+begin_src elisp :tangle init.el
       electric          ; smarter, keyword-based electric-indent
#+end_src

*** IBuffer

See what buffers are open and select among them
#+begin_src elisp :tangle init.el
       ibuffer         ; interactive buffer management
#+end_src

Set up ibuffer with projectile sorting

#+begin_src elisp :tangle config.el
(add-hook 'ibuffer-hook
          (lambda ()
            (ibuffer-projectile-set-filter-groups)
            (unless (eq ibuffer-sorting-mode 'alphabetic)
              (ibuffer-do-sort-by-alphabetic))))

#+end_src

*** Undo

Better undo
#+begin_src elisp :tangle init.el
       undo              ; persistent, smarter undo for your inevitable mistakes
#+end_src

*** VC

Git
#+begin_src elisp :tangle init.el
       vc                ; version-control and Emacs, sitting in a tree
#+end_src

** Terminals

In case your terminal isn't good enough, emacs is one too

#+begin_src elisp :tangle init.el
       :term
#+end_src

*** ESHell

elisp shell
#+begin_src elisp :tangle init.el
       ;;eshell            ; the elisp shell that works everywhere
#+end_src

*** Shell

a shell
#+begin_src elisp :tangle init.el
       ;;shell             ; simple shell REPL for Emacs
#+end_src

*** Term

terminal emulator
#+begin_src elisp :tangle init.el
       ;;term              ; basic terminal emulator for Emacs
#+end_src

*** VTerm

virtual terminal emulator
#+begin_src elisp :tangle init.el
       vterm             ; the best terminal emulation in Emacs
#+end_src

** Checkers

Checking syntax, spelling, stuff

#+begin_src elisp :tangle init.el
       :checkers
#+end_src

*** Syntax

Code syntax
#+begin_src elisp :tangle init.el
       syntax              ; tasing you for every semicolon you forget
#+end_src

*** Spelling

#+begin_src elisp :tangle init.el
       ;;(spell +flyspell) ; tasing you for misspelling mispelling
#+end_src

*** Grammar


#+begin_src elisp :tangle init.el
       ;;grammar           ; tasing grammar mistake every you make
#+end_src

** Tools

Cool tools for doing things - mostly command line

#+begin_src elisp :tangle init.el
       :tools
#+end_src

*** Ansible

Setting up computers remotely, the old way
#+begin_src elisp :tangle init.el
       ;;ansible
#+end_src

*** Biblio

Plug citations into latex
#+begin_src elisp :tangle init.el
       ;;biblio            ; Writes a PhD for you (citation needed)
#+end_src

*** Collab

Remote buffers for all the friends emacs users don't have
#+begin_src elisp :tangle init.el
       ;;collab            ; buffers with friends
#+end_src

*** Debugger

Sometimes you need to know what the code is actually doing
#+begin_src elisp :tangle init.el
       (debugger +lsp)          ; FIXME stepping through code, to help you add bugs
#+end_src

*** Direnv

Can't have per-directory environment without per-directory
#+begin_src elisp :tangle init.el
       direnv
#+end_src

*** Docker

Fake systems
#+begin_src elisp :tangle init.el
       ;;docker
#+end_src

*** Editorconfig

Getting the same settings as the team
#+begin_src elisp :tangle init.el
       editorconfig      ; let someone else argue about tabs vs spaces
#+end_src

*** EIN (Jupyter)

Isn't Jupyter just org mode for python?
#+begin_src elisp :tangle init.el
       ;;ein               ; tame Jupyter notebooks with emacs
#+end_src

*** Eval

Run emacs in emacs
#+begin_src elisp :tangle init.el
       (eval +overlay)     ; run code, run (also, repls)
#+end_src

*** Lookup

Finding things in your emacs
#+begin_src elisp :tangle init.el
       lookup              ; navigate your code and its documentation
#+end_src

*** LSP

What if emacs was an IDE? (It's not)
#+begin_src elisp :tangle init.el
       (lsp +peek)               ; M-x vscode
#+end_src

 Set global LSP options
 #+begin_src elisp *tangle config.el

(after! lsp-mode (
                  setq lsp-lens-enable t
                  lsp-ui-peek-enable t
                  lsp-ui-doc-enable nil
                  lsp-ui-doc-position 'bottom
                  lsp-ui-doc-max-height 70
                  lsp-ui-doc-max-width 150
                  lsp-ui-sideline-show-diagnostics t
                  lsp-ui-sideline-show-hover nil
                  lsp-ui-sideline-show-code-actions t
                  lsp-ui-sideline-diagnostic-max-lines 20
                  lsp-ui-sideline-ignore-duplicate t
                  lsp-ui-sideline-enable t))

 #+end_src
*** Magit

This is the worst name for a git client, and its an entirely different porcelain which I don't need
but it puts blame in the buffers
#+begin_src elisp :tangle init.el
       magit             ; a git porcelain for Emacs
#+end_src

*** Make

What if we didn't learn anything in the last 40 years (said from Emacs)
#+begin_src elisp :tangle init.el
       ;;make              ; run make tasks from Emacs
#+end_src

*** Password

Emacs can do everything (in a very mediocre way)
#+begin_src elisp :tangle init.el
       ;;pass              ; password manager for nerds
#+end_src

*** PDF

Do I want this?
#+begin_src elisp :tangle init.el
       ;;pdf               ; pdf enhancements
#+end_src

*** Prodigy

Monit but in emacs
#+begin_src elisp :tangle init.el
       ;;prodigy           ; FIXME managing external services & code builders
#+end_src

*** RGB

Strings
#+begin_src elisp :tangle init.el
       ;;rgb               ; creating color strings
#+end_src

*** Taskrunner

Deprecated
#+begin_src elisp :tangle init.el
       ;;taskrunner        ; taskrunner for all your projects
#+end_src

*** Terraform

I do this at work!
#+begin_src elisp :tangle init.el
       terraform         ; infrastructure as code
#+end_src

*** TMUX

For people without modern terminals
#+begin_src elisp :tangle init.el
       ;;tmux              ; an API for interacting with tmux
#+end_src

*** Tree-sitter

Make emacs understand what code should look like
#+begin_src elisp :tangle init.el
       tree-sitter       ; syntax and parsing, sitting in a tree...
#+end_src

*** Upload

seems overkill
#+begin_src elisp :tangle init.el
       ;;upload            ; map local to remote projects via ssh/ftp
#+end_src

** OS

Setting up your operating system
#+begin_src elisp :tangle init.el
       :os
#+end_src

*** MacOs compatibility
#+begin_src elisp :tangle init.el
       (:if (featurep :system 'macos) macos)  ; improve compatibility with macOS
#+end_src

*** TTY Compatibility

Might want this if I want emacs in a terminal ever
#+begin_src elisp :tangle init.el
       ;;tty               ; improve the terminal Emacs experience
#+end_src

** Programming Languages
#+begin_src elisp :tangle init.el
       :lang
#+end_src

#+RESULTS:
: :lang

*** Agda

Its esoteric and has good types - cool. You need a special keyboard - cooler
#+begin_src elisp :tangle init.el
       ;;agda              ; types of types of types of types...
#+end_src

*** Beancount

Emacs double entry book-keeping. Like acountants would use emacs
#+begin_src elisp :tangle init.el
       ;;beancount         ; mind the GAAP
#+end_src

*** CC

C or C**
#+begin_src elisp :tangle init.el
       (cc +lsp)         ; C > C++ == 1
#+end_src

*** Clojure

A lisp you can use for work
#+begin_src elisp :tangle init.el
       ;;clojure           ; java with a lisp
#+end_src

*** COBOL

#+begin_src elisp :tangle packages.el
(package! cobol-mode)
#+end_src

#+begin_src elisp :tangle config.el


;(after! cobol-mode (setq auto-mode-alist
      ;; (append
      ;;  '(("\\.cob\\'" . cobol-mode)
      ;;    ("\\.cbl\\'" . cobol-mode)
      ;;    ("\\.cpy\\'" . cobol-mode))
      ;;  auto-mode-alist)))
#+end_src
*** Common Lisp

A lisp proffesionals use for work
#+begin_src elisp :tangle init.el
       ;;common-lisp       ; if you've seen one lisp, you've seen them all
#+end_src

*** COQ

The theorem proving language
#+begin_src elisp :tangle init.el
       ;;coq               ; proofs-as-programs
#+end_src

*** Crystal

Everyone wants fast ruby, but not typed ruby
#+begin_src elisp :tangle init.el
       ;;crystal           ; ruby at the speed of c
#+end_src

*** C-Sharp

Cause Microsoft didn't own java
#+begin_src elisp :tangle init.el
       ;;csharp            ; unity, .NET, and mono shenanigans
#+end_src

*** Data

"Data" the language?
#+begin_src elisp :tangle init.el
       ;;data              ; config/data formats
#+end_src

*** Dart

What if you could make UIs, but with objects
#+begin_src elisp :tangle init.el
       ;;(dart +flutter)   ; paint ui and not much else
#+end_src

*** Dhall

Side-effect free config language
#+begin_src elisp :tangle init.el
       ;;dhall
#+end_src

*** Elixir

I guess its fine for work
#+begin_src elisp :tangle init.el
       (elixir +lsp +tree-sitter)            ; erlang done right
#+end_src


Add ".elixir2" files to the list of files that trigger the mode
 #+begin_src elisp :tangle config.el
(add-to-list 'auto-mode-alist '("\\.elixir2\\'" . elixir-mode))
 ;Create a buffer-local hook to run elixir-format on save, only when we enable elixir-mode.
;(add-hook 'elixir-mode-hook
;         (lambda () (add-hook 'before-save-hook 'elixir-format nil t)))
 #+end_src


**** Alchemist
An elixir mode for interacting with mix. Can compile and run tests.

Install alchemist cause it seems like doom didn't pull it?
#+begin_src elisp :tangle packages.el
;;(unless (package-installed-p 'alchemist)
;;  (package-install 'alchemist))
(if (package-installed-p 'alchemist)
   (progn
    ;;  No action needed, its here
     )
        (package! alchemist)
    )
#+end_src


Setup mix for nix
#+begin_src elisp :tangle config.el
 (setq alchemist-mix-command "/etc/profiles/per-user/zell/bin/mix")
#+end_src

and configure it?
#+begin_src elisp :tangle config.el
(use-package! alchemist
  :hook (elixir-mode . alchemist-mode)
  :config
  (set-lookup-handlers! 'elixir-mode
    :definition #'alchemist-goto-definition-at-point
    :documentation #'alchemist-help-search-at-point)
  (set-eval-handler! 'elixir-mode #'alchemist-eval-region)
  (set-repl-handler! 'elixir-mode #'alchemist-iex-project-run)
  (setq alchemist-mix-env "dev")
  (map! :map elixir-mode-map :nv "m" alchemist-mode-keymap))
#+end_src

**** LSP

Configure some LSP options
#+begin_src elisp :tangle config.el
(setq lsp-elixir-fetch-deps nil)
(setq lsp-elixir-suggest-specs nil)
(setq lsp-elixir-signature-after-complete t)
(setq lsp-elixir-enable-test-lenses t)
#+end_src

Set some global LSP options as well
#+begin_src elisp :tangle config.el
(after! lsp-ui (
setq lsp-lens-enable t
lsp-ui-peek-enable t
lsp-ui-doc-enable nil
lsp-ui-doc-position 'bottom
lsp-ui-doc-max-height 70
lsp-ui-doc-max-width 150
lsp-ui-sideline-show-diagnostics t
lsp-ui-sideline-show-hover nil
lsp-ui-sideline-show-code-actions t
lsp-ui-sideline-diagnostic-max-lines 20
lsp-ui-sideline-ignore-duplicate t
lsp-ui-sideline-enable t))
#+end_src

**** Copilot

Add a copilot indentation for elixir
#+begin_src elisp :tangle config.el

(defvar universal-indent 2)

(after! (evil copilot)
  (add-to-list 'copilot-indentation-alist '(elixir-mode universal-indent)))
#+end_src

*** ELM
Someone wanted haskell for flux loop
#+begin_src elisp :tangle init.el
       ;;elm               ; care for a cup of TEA?
#+end_src

*** ELisp

Use it for this thingy
#+begin_src elisp :tangle init.el
       emacs-lisp        ; drown in parentheses
#+end_src


*** Erlang

Doesn't know what a string is
#+begin_src elisp :tangle init.el
       ;;erlang            ; an elegant language for a more civilized age
#+end_src

