doom/init.el

;;objed             ; text object editing for the innocent

;;parinfer          ; turn lisp into python, sort of

;;rotate-text       ; cycle region at point between text candidates

snippets          ; my elves. They type so I don't have to

;;word-wrap         ; soft wrapping with language-aware indent

:emacs

dired             ; making dired pretty [functional]

electric          ; smarter, keyword-based electric-indent

ibuffer         ; interactive buffer management

undo              ; persistent, smarter undo for your inevitable mistakes

vc                ; version-control and Emacs, sitting in a tree

:term

;;eshell            ; the elisp shell that works everywhere

;;shell             ; simple shell REPL for Emacs

;;term              ; basic terminal emulator for Emacs

vterm             ; the best terminal emulation in Emacs

:checkers

syntax              ; tasing you for every semicolon you forget

;;(spell +flyspell) ; tasing you for misspelling mispelling

;;grammar           ; tasing grammar mistake every you make

:tools

;;ansible

;;biblio            ; Writes a PhD for you (citation needed)

;;collab            ; buffers with friends

(debugger +lsp)          ; FIXME stepping through code, to help you add bugs

direnv

docker

editorconfig      ; let someone else argue about tabs vs spaces

;;ein               ; tame Jupyter notebooks with emacs

(eval +overlay)     ; run code, run (also, repls)

lookup              ; navigate your code and its documentation

(lsp +peek)               ; M-x vscode

magit             ; a git porcelain for Emacs

;;make              ; run make tasks from Emacs

;;pass              ; password manager for nerds

;;pdf               ; pdf enhancements

;;prodigy           ; FIXME managing external services & code builders

;;rgb               ; creating color strings

;;taskrunner        ; taskrunner for all your projects

terraform         ; infrastructure as code

;;tmux              ; an API for interacting with tmux

tree-sitter       ; syntax and parsing, sitting in a tree...

;;upload            ; map local to remote projects via ssh/ftp

:os

(:if (featurep :system 'macos) macos)  ; improve compatibility with macOS

;;tty               ; improve the terminal Emacs experience

:lang

;;agda              ; types of types of types of types...

;;beancount         ; mind the GAAP

(cc +lsp)         ; C > C++ == 1

;;clojure           ; java with a lisp

;;common-lisp       ; if you've seen one lisp, you've seen them all

;;coq               ; proofs-as-programs

;;crystal           ; ruby at the speed of c

;;csharp            ; unity, .NET, and mono shenanigans

;;data              ; config/data formats

;;(dart +flutter)   ; paint ui and not much else

;;dhall

(elixir +tree-sitter +lsp)            ; erlang done right

;;elm               ; care for a cup of TEA?

emacs-lisp        ; drown in parentheses

;;erlang            ; an elegant language for a more civilized age
