doom/README.org
*** Ess

Statistics?
#+begin_src elisp :tangle init.el
       ;;ess               ; emacs speaks statistics
#+end_src

*** Factor

Stack based and not popular, apparently
#+begin_src elisp :tangle init.el
       ;;factor
#+end_src

*** Faust

Sound processing language
#+begin_src elisp :tangle init.el
       ;;faust             ; dsp, but you get to keep your soul
#+end_src

*** Fortran

Older than bones, but still not dead
#+begin_src elisp :tangle init.el
       ;;fortran           ; in FORTRAN, GOD is REAL (unless declared INTEGER)
#+end_src

*** F#

What if Microsoft had a haskell
#+begin_src elisp :tangle init.el
       ;;fsharp            ; ML stands for Microsoft's Language
#+end_src

*** FStar

Somebody is working on it
#+begin_src elisp :tangle init.el
       ;;fstar             ; (dependent) types and (monadic) effects and Z3
#+end_src

*** GDScript

Godot script
#+begin_src elisp :tangle init.el
       ;;gdscript          ; the language you waited for
#+end_src

*** GoLang

Its fine
#+begin_src elisp :tangle init.el
       ;;(go +lsp)         ; the hipster dialect
#+end_src

*** GraphQL

Ask for what you need
#+begin_src elisp :tangle init.el
       ;;(graphql +lsp)    ; Give queries a REST
#+end_src

*** Haskell

The best, if you can get it to work
#+begin_src elisp :tangle init.el
       (haskell +lsp)    ; a language that's lazier than I am
#+end_src

*** HY

Lisp embedded in python
#+begin_src elisp :tangle init.el
       ;;hy                ; readability of scheme w/ speed of python
#+end_src

*** Idriss

Another typed functional language
#+begin_src elisp :tangle init.el
       ;;idris             ; a language you can depend on
#+end_src

*** JSON

YAML but with more quotes
#+begin_src elisp :tangle init.el
       json              ; At least it ain't XML
#+end_src

*** Java

Write once, debug everywhere
#+begin_src elisp :tangle init.el
       ;;(java +lsp)       ; the poster child for carpal tunnel syndrome
#+end_src

*** Javascript

Runs in the operating system of the present (browser)
#+begin_src elisp :tangle init.el
       ;;javascript        ; all(hope(abandon(ye(who(enter(here))))))
#+end_src

*** Julia

#+begin_src elisp :tangle init.el
       ;;julia             ; a better, faster MATLAB
#+end_src

*** Kotlin

Java++
#+begin_src elisp :tangle init.el
       ;;kotlin            ; a better, slicker Java(Script)
#+end_src

*** Latex

Make a resume
#+begin_src elisp :tangle init.el
       ;;latex             ; writing papers in Emacs has never been so fun
#+end_src

*** Lean

Another theorem prover
#+begin_src elisp :tangle init.el
       ;;lean              ; for folks with too much to prove
#+end_src

*** Ledger

Another book-keeper
#+begin_src elisp :tangle init.el
       ;;ledger            ; be audit you can be
#+end_src

*** Lua

The best language to put in your langauge
#+begin_src elisp :tangle init.el
       lua               ; one-based indices? one-based indices
#+end_src

*** Markdown

Its pretty low-lift
#+begin_src elisp :tangle init.el
       markdown          ; writing docs for people to ignore
#+end_src

*** Nim

Typed language again
#+begin_src elisp :tangle init.el
       ;;nim               ; python + lisp at the speed of c
#+end_src

*** Nix

The OS controller
#+begin_src elisp :tangle init.el
       nix               ; I hereby declare "nix geht mehr!"
#+end_src

*** OCaml

Pretty good
#+begin_src elisp :tangle init.el
       ;;ocaml             ; an objective camel
#+end_src

*** Org

Not logseq (edit: YOU FOOL! Logseq support org format!!)
#+begin_src elisp :tangle init.el
       (org +roam2)               ; organize your plain life in plain text
#+end_src

 Make sure org mode can tangle some basics. Also prompt to tangle after save - works with auto save
 #+begin_src elisp :tangle config.el
(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (shell . t)
   (emacs-lisp . t)
   ))

(add-hook 'after-save-hook (lambda ()(if (y-or-n-p "Tangle?")(org-babel-tangle))) nil t)
 #+end_src

 If you use `org' and don't want your org files in the default location below,
 change `org-directory'. It must be set before org loads!
 #+begin_src elisp :tangle config.el

(setq org-directory "~/logseq/")
(setq org-roam-directory "~/logseq/")
(setq org-roam-dailies-directory "journals/")

 #+end_src

#+begin_src elisp :tangle config.el
(custom-set-faces!
  `(org-level-1 :family "Luminari" :height 400)
  `(org-level-2 :family "Cochin" :height 300)
  `(org-level-3 :family "Rockwell" :height 200)
  `(org-level-4 :family "Rockwell" :height 150)
  `(org-level-5 :family "Rockwell" :height 150)
  `(org-level-6 :family "Rockwell" :height 150)
                )

#+end_src

*** PHP

oh god oh god
#+begin_src elisp :tangle init.el
       ;;php               ; perl's insecure younger brother
#+end_src

*** PlantUML

UML D:
#+begin_src elisp :tangle init.el
       ;;plantuml          ; diagrams for confusing people more
#+end_src

*** Purescript

They tried
#+begin_src elisp :tangle init.el
       purescript        ; javascript, but functional
#+end_src

*** Python

Misplaced principals
#+begin_src elisp :tangle init.el
       ;;python            ; beautiful is better than ugly
#+end_src

*** QT

It works
#+begin_src elisp :tangle init.el
       ;;qt                ; the 'cutest' gui framework ever
#+end_src

*** Racket

Language definer
#+begin_src elisp :tangle init.el
       ;;racket            ; a DSL for DSLs
#+end_src

*** Raku

perl
#+begin_src elisp :tangle init.el
       ;;raku              ; the artist formerly known as perl6
#+end_src

*** Rest

I guess emacs does this too
#+begin_src elisp :tangle init.el
       ;;rest              ; Emacs as a REST client
#+end_src

*** RST

Another one
#+begin_src elisp :tangle init.el
       ;;rst               ; ReST in peace
#+end_src

*** Ruby

Big mistake
#+begin_src elisp :tangle init.el
;;(ruby +rails)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
#+end_src

*** Rust

Make it fast, make it safe
#+begin_src elisp :tangle init.el
       ;;(rust +lsp)       ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
#+end_src

*** Scala

Like 10 languages in one
#+begin_src elisp :tangle init.el
       ;;scala             ; java, but good
#+end_src

*** Scheme

A good lisp
#+begin_src elisp :tangle init.el
       ;;(scheme +guile)   ; a fully conniving family of lisps
#+end_src

*** SH

Shell programming
#+begin_src elisp :tangle init.el
       sh                ; she sells {ba,z,fi}sh shells on the C xor
#+end_src

*** Standard ML

ML
#+begin_src elisp :tangle init.el
       ;;sml
#+end_src

*** Solidity

Blockchain 🤢
#+begin_src elisp :tangle init.el
       ;;solidity          ; do you need a blockchain? No.
#+end_src

*** Swift

Better than objective c?
#+begin_src elisp :tangle init.el
       ;;swift             ; who asked for emoji variables?
#+end_src

*** Terra

Standalone low-level language of lua
#+begin_src elisp :tangle init.el
       ;;terra             ; Earth and Moon in alignment for performance.
#+end_src

*** Web

Web?
#+begin_src elisp :tangle init.el
       web               ; the tubes
#+end_src

*** YAML

JSON, with invisible brackets
#+begin_src elisp :tangle init.el
       yaml              ; JSON, but readable
#+end_src

*** Zig

Rust's less popular brother
#+begin_src elisp :tangle init.el
       ;;zig               ; C, but simpler
#+end_src

** Email

NO
#+begin_src elisp :tangle init.el
       :email
       ;;(mu4e +org +gmail)
       ;;notmuch
       ;;(wanderlust +gmail)
#+end_src

** Apps

Why not just use the real thing?
#+begin_src elisp :tangle init.el
       :app
       ;;calendar
       ;;emms
       ;;everywhere        ; *leave* Emacs!? You must be joking
       ;;irc               ; how neckbeards socialize
       ;;(rss +org)        ; emacs as an RSS reader
       ;;twitter           ; twitter client https://twitter.com/vnought
#+end_src

** Config
#+begin_src elisp :tangle init.el
       :config
       literate
       (default +bindings +smartparens)
)
#+end_src
#+end_src

* Packages
:PROPERTIES:
:header-args: :tangle packages.el :comments org
:END:
Here we will install any packages not found in the default modules


* Code Utilities

** Commenting

#+begin_src elisp :tangle packages.el
(package! evil-commentary)
#+end_src
